[{"timestamp":1699832992324,"id":96,"title":"Mobile Games: The New Frontier in Political Satire?"},{"timestamp":1699832967605,"id":95,"title":"Title: The Impeachment Game: A Dystopian View of US Politics"},{"timestamp":1699832947996,"id":94,"title":"US Senate: The Art of Political Strategy in the 21st Century"},{"timestamp":1699832902662,"id":93,"title":"Title: The Impeachment Game: A Dystopian Future of Political Strategy"},{"timestamp":1699832881705,"id":92,"title":"US Representatives and US Supreme Court: A Dystopian Vision of Taxation"},{"timestamp":1699832859462,"id":91,"title":"Political Strategy in a Dystopian Future: Can the US Senate Save Us?"},{"timestamp":1699832816732,"id":90,"title":"US Senate Impeachment Trial: A Game of Political Strategy?"},{"timestamp":1699832791645,"id":89,"title":"Exploring the intersection of gaming and politics: How mobile games are shaping US Congress strategy"},{"timestamp":1699832745856,"id":88,"title":"US Representatives Play Strategy Games to Shape Political Strategy: A Satirical Take on the Halls of Power"},{"timestamp":1699832715636,"id":87,"title":"US Senators Play Mobile Games to Fund Political Campaigns: A Dystopian Future?"},{"timestamp":1699832667141,"id":86,"title":"Political Strategy in a Dystopian Future: How Mobile Games Could Shape the Course of History"},{"timestamp":1699832636909,"id":85,"title":"Strategizing for a Dystopian Future: The Intersection of US Politics and Strategy Games"},{"timestamp":1699832606800,"id":84,"title":"US Representatives Strategize in Mobile Games: A New Frontier for Political Manipulation?"},{"timestamp":1699832506286,"id":83,"title":"US Government: The Rise of Dystopian Politics in Mobile Games"},{"timestamp":1699832480551,"id":82,"title":"Senators' Mobile Gamble: Can Political Strategy Overcome Impeachment?"},{"timestamp":1699832459753,"id":81,"title":"Political Games: How the US House and Senate are Revolutionizing Strategy Development in Gaming"},{"timestamp":1699832422808,"id":80,"title":"Unlocking the Secrets of Dystopian Politics: A Strategy Game Challenge"},{"timestamp":1699832393474,"id":79,"title":"US House of Representatives Impeaches Mobile Game Developer Over Taxation Concerns: A Satirical Tale"},{"timestamp":1699832366591,"id":78,"title":"Taxation in a Dystopian Future: A Political Satire"},{"timestamp":1699832346073,"id":77,"title":"The Constitutional Coup: How Strategy Games Are Shaping Political Satire in the Age of Impeachment"},{"timestamp":1699832321050,"id":76,"title":"Impeachment Invasion: How Mobile Games Are Redefining Political Strategy"},{"timestamp":1699832299449,"id":75,"title":"US Government's Political Games: A Dystopian Fiction Come to Life?"},{"timestamp":1699832243146,"id":74,"title":"The Impeachment Game: Strategizing for Freedom in a Dystopian Political Landscape"},{"timestamp":1699832206422,"id":73,"title":"US Politics: The Future of Impeachment"},{"timestamp":1699832168633,"id":72,"title":"Exploring the Dystopian Implications of Unchecked Taxation: A US Government in Peril?"},{"timestamp":1699832132874,"id":71,"title":"Dystopian Fiction Predicts a Future Where Impeachment Becomes the Norm: An Examination of the Political Strateg"},{"timestamp":1699832106634,"id":70,"title":"The Satirical Political Strategy of Mobile Games: A US Government Analysis"},{"timestamp":1699832054819,"id":69,"title":"Impeached: The Future of US Politics Hangs in the Balance"},{"timestamp":1699832025256,"id":68,"title":"Strategizing for Impeachment: Can US Senators Save the Constitution?"},{"timestamp":1699831994110,"id":67,"title":"US Senators Propose New Taxation Plan: Will it Pass in the Senate?"},{"timestamp":1699831940267,"id":66,"title":"US Constitution vs. Political Games: Can the Founding Document Survive in a World of Strategy and Satire?"},{"timestamp":1699831913032,"id":65,"title":"US Supreme Court Weighs In on Strategy Games: Could Impeachment be a Political Tactic?"},{"timestamp":1699831892166,"id":64,"title":"Title: Impeachment Insurrection: A Constitutional Crisis in the Digital Age"},{"timestamp":1699831859964,"id":63,"title":"Representatives from Across the Political Spectrum Unite to Create a Dystopian Future in Satirical Strategy Game"},{"timestamp":1699831831004,"id":62,"title":"US Government Unveils New Dystopian Fiction Initiative: Will it Save or Destroy Democracy?"},{"timestamp":1699831804183,"id":61,"title":"Unlocking the Secrets of Taxation: Can US Representatives Use Mobile Games to Revolutionize Government Funding?"},{"timestamp":1699831771531,"id":60,"title":"The Future of Taxation: How US Congress is Revolutionizing the Game"},{"timestamp":1699831726091,"id":59,"title":"US Presidents Play Political Games of Thrones: A Dystopian Future?"},{"timestamp":1699831667427,"id":58,"title":"US Presidents: The Satirical Showdown - How Democrats and Republicans are Using Impeachment as a Political Weapon in"},{"timestamp":1699831638954,"id":57,"title":"The Constitutional Quandary of Mobile Gaming: A Game Theoretic Analysis"},{"timestamp":1699831611897,"id":56,"title":"Dystopian Fiction Unveils Political Games of Taxation and Strategy"},{"timestamp":1699831585936,"id":55,"title":"Dystopian Fiction Impeachment: The Future of US Politics?"},{"timestamp":1699831555464,"id":54,"title":"Impeachment Invasion: How Dystopian Fiction is Shaping Political Strategy in the US Senate"},{"timestamp":1699831532366,"id":53,"title":"Democrats Eye US Senate Takeover: A New Era of Political Strategy Games?"},{"timestamp":1699831505189,"id":52,"title":"Title: The Political Strategy of Game of Thrones: A Satirical Look at the US Government"},{"timestamp":1699831464132,"id":51,"title":"US House of Representatives Impeaches President in Blow to Democracy: A New Dystopian Fiction?"},{"timestamp":1699831436332,"id":50,"title":"US Senate Impeaches President in Blow to Government: A Look at the Implications for US Politics and Beyond"},{"timestamp":1699831404088,"id":49,"title":"Impeachment Insurgency: How the US Supreme Court Could Upend the Political Landscape"},{"timestamp":1699831357769,"id":48,"title":"Political Strategies in the Digital Age: How Mobile Games are Redefining US Politics"},{"timestamp":1699831329003,"id":47,"title":"Mobile Games and the Political Battlefield: How Democrats and Republicans are Using Gaming Strategies to Shape US Policy"},{"timestamp":1699831285508,"id":46,"title":"How the US Constitution Can Teach Us About Mobile Game Design: A New Perspective"},{"timestamp":1699831254152,"id":45,"title":"US Senators Turn to Satire to Critique Taxation and Government Overreach in Dystopian Future"},{"timestamp":1699831223879,"id":44,"title":"Senators Play Mobile Games to Understand Taxation Consequences: A New Approach to Constitutional Impeachment?"},{"timestamp":1699831196704,"id":43,"title":"Dystopian Future of Taxation: How Republicans are Using Gaming Strategies to Impeach Democrats in the US Senate"},{"timestamp":1699831177415,"id":42,"title":"Impeachment Invasion: Can the US Congress Outsmart Political Foes Through Strategy Games?"},{"timestamp":1699831122013,"id":41,"title":"Political Games: The New Frontier for US Senators"},{"timestamp":1699831096878,"id":40,"title":"Republicans Embrace Taxation: A Dystopian Future Unfolds?"},{"timestamp":1699831073002,"id":39,"title":"Unlocking the Secrets of Political Satire: How Strategy Games and Mobile Apps Are Revolutionizing US Politics"},{"timestamp":1699831041089,"id":38,"title":"Congress Takes a Cue from Dystopian Fiction: Impeachment Games Begin"},{"timestamp":1699831007941,"id":37,"title":"Political Games: The Constitutional Impeachment Showdown in Washington D.C."},{"timestamp":1699830981397,"id":36,"title":"Senate Shuffle: How Gaming Could Save US Politics"},{"timestamp":1699830943777,"id":35,"title":"US Senate Impeachment Trial: A Game of Political Chess?"},{"timestamp":1699830914241,"id":34,"title":"US Representatives Play Economic Political Games of Power and Taxation in Dystopian Future"},{"timestamp":1699830884782,"id":33,"title":"Political Games: How Strategy Games Inspire Real-Life Political Strategies"},{"timestamp":1699830846295,"id":32,"title":"US Senators Play Strategy Games, But At What Cost to Freedom? Examining the Impact of Mobile Gaming on Dyst"},{"timestamp":1699830822583,"id":31,"title":"Taxation in a Dystopian Future: A Political Strategy for the Win"},{"timestamp":1699830798149,"id":30,"title":"Freedom in the Age of Political Games: A Dystopian Fiction"},{"timestamp":1699830777084,"id":29,"title":"US Politics Meet Mobile Games: How Constitutional Rights Are Being Exploited in Political Strategy Titles"},{"timestamp":1699830752543,"id":28,"title":"The US Supreme Court: A Battleground for Political Power"},{"timestamp":1699830727224,"id":27,"title":"US Supreme Court Weighs Landmark Impeachment Case: Can the President Be Jailed for Tax Evasion?"},{"timestamp":1699830696093,"id":26,"title":"Political Games: Can the US Senate Outsmart Impeachment?"},{"timestamp":1699830672287,"id":25,"title":"Political Strategies in a Dystopian Future: Can the US Government Keep Up?"},{"timestamp":1699830654425,"id":24,"title":"Taxation & Impeachment: A Game of Political Power Struggles"},{"timestamp":1699830631872,"id":23,"title":"The Rise of Political Satire in Mobile Games: A New Frontier for Social Commentary"},{"timestamp":1699830544774,"id":22,"title":"Title: The Political Strategy of Taxation in a Dystopian Future"},{"timestamp":1699830516958,"id":21,"title":"US Representatives in Dystopian Fiction: How Taxation and Political Strategy Shape the Future of Government"},{"timestamp":1699830484234,"id":20,"title":"Freedom or Impeached? The Future of US Politics in a Mobile Game"},{"timestamp":1699830454441,"id":19,"title":"US Government Impeaches President Over Taxation Concerns: A New Era of Political Strategy Games Begins"},{"timestamp":1699830432248,"id":18,"title":"US Supreme Court to Rule on Impeachment: A Dystopian Fiction Come True?"},{"timestamp":1699830404985,"id":17,"title":"US Supreme Court: The New Battleground for Political Strategy?"},{"timestamp":1699830388538,"id":16,"title":"Impeachment: The Dystopian Future of US Politics"},{"timestamp":1699830344491,"id":15,"title":"Mobile Games Take Center Stage in US Supreme Court Showdown: Can Political Satire Save the Republic?"},{"timestamp":1699830316877,"id":14,"title":"Senate Showdown: Can the US Government's Economic Woes Be Fixed with a Little Political Gaming?"},{"timestamp":1699830284697,"id":13,"title":"Republicans vs. Freedom: The Battle for Mobile Game Supremacy in a Dystopian Future US Government"},{"timestamp":1699830247356,"id":12,"title":"Republicans vs. Democrats: The Battle for Freedom in a Dystopian Future"},{"timestamp":1699830214412,"id":11,"title":"US Senators Play Political Games of Impeachment and Taxation in Dystopian Fiction-Inspired Mobile Game"},{"timestamp":1699830181965,"id":10,"title":"House of Representatives Play 'Impeachment Roulette': A New Political Game Takes Washington by Storm"},{"timestamp":1699830162613,"id":9,"title":"Exploring the Political Strategies of Impeachment: A Constitutional Conundrum"},{"timestamp":1699830107052,"id":8,"title":"Mobile Games: The New Frontier for Political Engagement?"},{"timestamp":1699830073407,"id":7,"title":"US Representatives Consider Impeachment of Unpopular President Amid Constitutional Crisis"},{"timestamp":1699830046108,"id":6,"title":"Impeachment Inquiry: Will Mobile Games Hold the Key to Unlocking Constitutional Crisis?"},{"timestamp":1699830016032,"id":5,"title":"Dystopian Fiction Meets US Politics: A Game of Survival in a Broken System"},{"timestamp":1699829978126,"id":4,"title":"The Rise of Dystopian Politics: How Republicans and Democrats Are Using Taxation to Control the Game in Washington"},{"timestamp":1699829937812,"id":3,"title":"US Presidents and Strategy Games: The Unlikely Alliance"},{"timestamp":1699829910350,"id":2,"title":"Taxation in a Dystopian Future: A New Political Strategy?"},{"timestamp":1699829885253,"id":1,"title":"Political Games: The Unwritten Rule of the Constitution"}]