[{"timestamp":1699830884782,"id":33,"title":"Political Games: How Strategy Games Inspire Real-Life Political Strategies"},{"timestamp":1699830846295,"id":32,"title":"US Senators Play Strategy Games, But At What Cost to Freedom? Examining the Impact of Mobile Gaming on Dyst"},{"timestamp":1699830822583,"id":31,"title":"Taxation in a Dystopian Future: A Political Strategy for the Win"},{"timestamp":1699830798149,"id":30,"title":"Freedom in the Age of Political Games: A Dystopian Fiction"},{"timestamp":1699830777084,"id":29,"title":"US Politics Meet Mobile Games: How Constitutional Rights Are Being Exploited in Political Strategy Titles"},{"timestamp":1699830752543,"id":28,"title":"The US Supreme Court: A Battleground for Political Power"},{"timestamp":1699830727224,"id":27,"title":"US Supreme Court Weighs Landmark Impeachment Case: Can the President Be Jailed for Tax Evasion?"},{"timestamp":1699830696093,"id":26,"title":"Political Games: Can the US Senate Outsmart Impeachment?"},{"timestamp":1699830672287,"id":25,"title":"Political Strategies in a Dystopian Future: Can the US Government Keep Up?"},{"timestamp":1699830654425,"id":24,"title":"Taxation & Impeachment: A Game of Political Power Struggles"},{"timestamp":1699830631872,"id":23,"title":"The Rise of Political Satire in Mobile Games: A New Frontier for Social Commentary"},{"timestamp":1699830544774,"id":22,"title":"Title: The Political Strategy of Taxation in a Dystopian Future"},{"timestamp":1699830516958,"id":21,"title":"US Representatives in Dystopian Fiction: How Taxation and Political Strategy Shape the Future of Government"},{"timestamp":1699830484234,"id":20,"title":"Freedom or Impeached? The Future of US Politics in a Mobile Game"},{"timestamp":1699830454441,"id":19,"title":"US Government Impeaches President Over Taxation Concerns: A New Era of Political Strategy Games Begins"},{"timestamp":1699830432248,"id":18,"title":"US Supreme Court to Rule on Impeachment: A Dystopian Fiction Come True?"},{"timestamp":1699830404985,"id":17,"title":"US Supreme Court: The New Battleground for Political Strategy?"},{"timestamp":1699830388538,"id":16,"title":"Impeachment: The Dystopian Future of US Politics"},{"timestamp":1699830344491,"id":15,"title":"Mobile Games Take Center Stage in US Supreme Court Showdown: Can Political Satire Save the Republic?"},{"timestamp":1699830316877,"id":14,"title":"Senate Showdown: Can the US Government's Economic Woes Be Fixed with a Little Political Gaming?"},{"timestamp":1699830284697,"id":13,"title":"Republicans vs. Freedom: The Battle for Mobile Game Supremacy in a Dystopian Future US Government"},{"timestamp":1699830247356,"id":12,"title":"Republicans vs. Democrats: The Battle for Freedom in a Dystopian Future"},{"timestamp":1699830214412,"id":11,"title":"US Senators Play Political Games of Impeachment and Taxation in Dystopian Fiction-Inspired Mobile Game"},{"timestamp":1699830181965,"id":10,"title":"House of Representatives Play 'Impeachment Roulette': A New Political Game Takes Washington by Storm"},{"timestamp":1699830162613,"id":9,"title":"Exploring the Political Strategies of Impeachment: A Constitutional Conundrum"},{"timestamp":1699830107052,"id":8,"title":"Mobile Games: The New Frontier for Political Engagement?"},{"timestamp":1699830073407,"id":7,"title":"US Representatives Consider Impeachment of Unpopular President Amid Constitutional Crisis"},{"timestamp":1699830046108,"id":6,"title":"Impeachment Inquiry: Will Mobile Games Hold the Key to Unlocking Constitutional Crisis?"},{"timestamp":1699830016032,"id":5,"title":"Dystopian Fiction Meets US Politics: A Game of Survival in a Broken System"},{"timestamp":1699829978126,"id":4,"title":"The Rise of Dystopian Politics: How Republicans and Democrats Are Using Taxation to Control the Game in Washington"},{"timestamp":1699829937812,"id":3,"title":"US Presidents and Strategy Games: The Unlikely Alliance"},{"timestamp":1699829910350,"id":2,"title":"Taxation in a Dystopian Future: A New Political Strategy?"},{"timestamp":1699829885253,"id":1,"title":"Political Games: The Unwritten Rule of the Constitution"}]